Repository: Gabrielbprado/MyRecipeBook.API
Catalog: src/Shared/MyRecipeBook.Exceptions/ResourceLanguage.*.resx
Languages: fr, pt_br

# EMAIL_EMPTY
source: the email cannot be empty
fr: l'email ne doit pas être vide
pt_br: O email não pode estar vazio

# EMAIL_INVALID
source: invalid email
fr: email non valide
pt_br: Email invalido

# NAME_EMPTY
source: name cannot be empty
fr: le nom ne doit pas être vide
pt_br: o nome não pode estar vazio

# PASSWORD_EMPTY
source: password must not be empty
fr: le mot de passe ne doit pas être vide
pt_br: a senha não pode estar vazia

# UNKNOW_ERROR
source: unknown error
fr: erreur inconnue
pt_br: Erro desconhecido

# PASSWORD_MINIMUM_LENGTH
source: the password must be at least 6 characters long
fr: le mot de passe doit comporter au moins 6 caractères
pt_br: a senha deve ter pelo menos 6 caracteres

# EMAIL_ALREADY_EXIST
source: the email already exist
fr: l'email existe déjà
pt_br: o e-mail já existe

# INVALID_LOGIN
source: Email or password not found
fr: Email ou mot de passe introuvable
pt_br: E-mail ou senha não encontrados

# NO_TOKEN
source: the token does not exist
fr: le jeton n'existe pas
pt_br: o Token não existe

# INCORRECT_PASSWORD
source: The current password is incorrect
fr: Le mot de passe actuel est incorrect
pt_br: A senha atual esta incorreta

# USER_WITHOUT_PERMISSION
source: Unauthorized user
fr: Utilisateur non autorisé
pt_br: Usuario não Autorizado

# RECIPE_TITLE_EMPTY
source: The Title cannot be empty
fr: Le titre ne peut être vide
pt_br: O título não pode estar vazio

# RECIPE_COOKING_TIME_INVALID
source: Invalid cooking time
fr: Temps de cuisson non valide
pt_br: Tempo de cozimento ínvalido

# RECIPE_DIFFICULTY_INVALID
source: Invalid difficulty
fr: Difficulté non valide
pt_br: Dificuldade ínvalida

# AT_LEAST_ONE_INGREDIENT
source: Recipe must contain at least 1 ingredient
fr: La recette doit contenir au moins 1 ingrédient
pt_br: A Receita deve conter pelo menos 1 ingrediente

# AT_LEAST_ONE_INSCTRUCTION
source: The recipe must contain at least one instruction
fr: La recette doit contenir au moins une instruction
pt_br: A receita deve conter pelo menos uma instrução

# DISH_TYPE_INVALID
source: Invalid dish type
fr: Type de plat non valide
pt_br: Tipo de Prato ínvalido

# INSTRUCTION_STEP_EMPTY
source: The instruction step cannot be empty
fr: L'étape d'instruction ne peut pas être vide
pt_br: O Passo da intrução não pode ser vazio

# INSTRUCTION_TEXT_EMPTY
source: The instruction text cannot be empty
fr: Le texte de l'instruction ne doit pas être vide
pt_br: O Texto da intrução não pode ser vazio

# INGREDIENT_NAME_EMPTY
source: Ingredient name cannot be empty
fr: Le nom de l'ingrédient ne peut pas être vide
pt_br: O Nome do ingrediente não pode ser vazio

# INGREDIENT_QUANTITY_EMPTY
source: Ingredient quantity must not be empty
fr: La quantité d'ingrédients ne doit pas être vide
pt_br: Quantidade do ingrediente não pode ser vazia

# INSTRUCTION_STEP_DUPLICATE
source: Os Passos da intrução não podem se repetir
fr: Les étapes de l'instruction ne peuvent pas être répétées
pt_br: Os Passos da instrução não podem se repetir

# INSTRUCTION_TEXT_MAX_LENGTH
source: The text must have a maximum of 2000 characters
fr: Le texte ne doit pas dépasser 2000 caractères
pt_br: O Texto deve ter no maximo 2000 Caracteres

# STEP_MUST_BE_GREATER_THAN_ZERO
source: The Step number must be greater than 0
fr: Le numéro d'étape doit être supérieur à 0
pt_br: O Numero da etapa deve ser maior que 0
